# St7GetCreepDefinitionNumByIndex

Returns the creep law number associated with the specified creep law index. The creep law indices are stored
internally and are based on a contiguous numbering system.

long St7GetCreepDefinitionNumByIndex(long uID, long Index, long* CreepID)

Input Parameters

uID

Strand7 model file ID.

Index

Creep law index.

Output Parameters

CreepID

Creep layout ID.